Repository: Eng-Ahmed-2019/MyInvoicingSystem
Catalog: Resources/Messages.*.resx
Languages: ar

# ArabicLettersOnly
source: This field must contain Arabic letters only
ar: هذا الحقل يجب أن يحتوي على حروف عربية فقط

# CompanyDescriptionArabicOnly
source: only arabic letters
ar: الوصف باللغة العربية فقط

# CompanyDescriptionEnglishOnly
source: only english letters
ar: الوصف يجب ان يكون باللغة العربية

# CompanyDescriptionMaxLength
source: Description must not exceed 500 characters.
ar: وصف الشركة لا يتجاوز ال 500 حرف

# CompanyNameArabicOnly
source: only arabic letters
ar: اسم الشركة باللغة العربية فقط

# CompanyNameArRequired
source: Arabic company name is required.
ar: اسم الشركة مطلوب.

# CompanyNameEnglishOnly
source: Company name must contain English letters only.
ar: اسم الشركة يحتوي علي حروف انجليزية فقط

# CompanyNameMaxLength
source: Company name must not exceed 150 characters.
ar: اسم الشركة لا يتجاوز ال 150 حرف

# CompanyNameMinLength
source: Company name must be at least 2 characters.
ar: اسم الشركة لا يجب ان يكون اقل من حرفين

# CompanyNameRequired
source: Company name is required.
ar: اسم الشركة بالعربية مطلوب.

# CompanyRequired
source: This Company is required.
ar: الشركة مطلوبة

# Company_Required
source: Company is required
ar: الشركة مطلوبة

source: Created successfully.
ar: تم الإنشاء بنجاح.

# CustomerEmailInvalid
source: Invalid email format.
ar: الايميل غير صحيح

# CustomerNameArabicRequired
source: Customer Arabic name is required.
ar: الاسم باللغة العربية مطلوب

# CustomerNameEnglishOnly
source: Customer name must contain English letters only.
ar: الاسم بالنجليزية فقط

# CustomerNameMaxLength
source: Customer name must not exceed 200 characters.
ar: اقصي اسم 200 حرف

# CustomerNameRequired
source: Customer name is required.
ar: الاسم مطلوب

# CustomerPhoneInvalid
source: Invalid phone number.
ar: رقم الهاتف غير صحيح

# Customer_Required
source: Customer is required
ar: العميل مطلوب

source: Deleted successfully.
ar: تم الحذف بنجاح.

# DescArArabicOnly
source: Description must contain Arabic only.
ar: الوصف باللغة العربية فقط

# DescEnglishOnly
source: Description must contain English only.
ar: الوصف باللغة الانجليزية فقط

# Description_TooLong
source: Description must be less than 1000 characters
ar: الوصف لا يتجاوز ال 1000 حرف

# EmailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# EnglishLettersOnly
source: This field must contain English letters only
ar: هذا الحقل يجب أن يحتوي على حروف إنجليزية فقط

# FullNameArMaxLength
source: Full name in Arabic cannot exceed 100 characters
ar: الاسم الكامل بالعربية لا يمكن أن يتجاوز 100 حرف.

# FullNameArRequired
source: Full name in Arabic is required
ar: الاسم الكامل بالعربية مطلوب.

# FullNameMaxLength
source: Full name cannot exceed 100 characters
ar: الاسم الكامل لا يمكن أن يتجاوز 100 حرف

# FullNameRequired
source: Full name is required
ar: الاسم الكامل مطلوب

# InvalidEmail
source: Invalid Email Address
ar: البريد الإلكتروني غير صالح

# InvoiceItem_DescriptionAr_Invalid
source: Description (Arabic) is invalid.
ar: الوصف باللغة العربية

# InvoiceItem_Description_Invalid
source: Description must contain English letters only
ar: الوصف باللغة الانجليزية فقط

# InvoiceItem_NameAr_Required
source: Arabic name is required.
ar: الاسم باللغة العربية مطلوب

# InvoiceItem_Name_Invalid
source: This field must contain English letters only.
ar: يجب ان يحتوي علي حروف باللغة الانجليزية فقط

# InvoiceItem_Name_Required
source: Name is required.
ar: الاسم مطلوب

# InvoiceItem_Quantity_Range
source: Quantity must be at least 1
ar: لا تقل الكمية عن واحد

# InvoiceItem_UnitPrice_Range
source: Unit price must be greater than 0.
ar: السعر يجب ان يكون اكبر من صفر

# InvoiceNumber_Required
source: Invoice number is required
ar: رقم الفاتورة مطلوب

# NameArArabicOnly
source: Item Arabic name must contain Arabic only.
ar: الاسم باللغة العربية فقط

# NameArMaxLength
source: Item Arabic name must not exceed 200 chars.
ar: الاسم باللغة العربية لا يتجاوز ال 200 حرف

# NameArRequired
source: Item Arabic name is required.
ar: العنصر مطلوب باللغة العربية

# NameEnglishOnly
source: Item name must contain English only.
ar: الاسم باللغة الانجليزية فقط

# NameMaxLength
source: Item name must not exceed 200 chars.
ar: الاسم لا يتجاوز ال 200 حرف

# NameRequired
source: Item name is required.
ar: الاسم مطلوب

source: Not found.
ar: غير موجود.

# PasswordRequired
source: Password is required
ar: كلمة المرور مطلوبة

# PriceRange
source: Unit price must be greater than 0.
ar: يجب ان يكون السعر اكبر من صفر

# RoleRequired
source: Role is required
ar: الدور مطلوب

# Role_DescriptionAr_MaxLength
source: Description in Arabic cannot exceed 250 characters.
ar: الوصف باللغة العربية لا يتجاوز ال 250 حرف

# Role_DescriptionAr_OnlyLetters
source: This field must contain Arabic letters only
ar: هذا الحقل يحتوي علي حروف باللغة العربية فقط

# Role_DescriptionEn_MaxLength
source: Description in English cannot exceed 250 characters
ar: الوصف بالانجليزية لا يتجاوز ال 150 حرف

# Role_DescriptionEn_OnlyLetters
source: This field must contain English letters only.
ar: هذا الحقل يجب ان يحتوي علي حروف انجليزية فقط

# Role_NameAr_MaxLength
source: Arabic name cannot exceed 100 characters
ar: الدور باللغة العربية لا يتجاوز ال 100 حرف

# Role_NameAr_OnlyLetters
source: This field must contain Arabic letters only
ar: حروف عربية فقط

# Role_NameAr_Required
source: Arabic name is required
ar: الاسم باللغة العربية مطلوب

# Role_NameEn_MaxLength
source: English name cannot exceed 100 characters
ar: الاسم بالانجليزية لا يتجاوز ال 100 حرف

# Role_NameEn_OnlyLetters
source: This field must contain English letters only
ar: يجب ان يكون باللغة الانجليزية فقط

# Role_NameEn_Required
source: English name is required
ar: الاسم باللغة الانجليزية مطلوب

# Subtotal_Range
source: Subtotal must be greater than or equal to 0
ar: المبلغ الفرعي يجب أن يكون أكبر من أو يساوي صفر

# Tax_Range
source: Tax must be greater than or equal to 0
ar: الضريبة يجب أن تكون أكبر من أو تساوي صفر

# TitleAr_Required
source: Arabic title is required
ar: العنوان باللغة العربية مطلوب

# Title_Required
source: Title is required
ar: العنوان مطلوب

# Total_Range
source: Total must be greater than or equal to 0
ar: الإجمالي يجب أن يكون أكبر من أو يساوي صفر

source: Updated successfully.
ar: تم التحديث بنجاح.

# UsernameMaxLength
source: Username cannot be longer than 50 characters
ar: سم المستخدم لا يمكن أن يتجاوز 50 حرف

# UsernameRequired
source: Username is required
ar: اسم المستخدم مطلوب
